package com.vladimirloyanich.speedreading;

public class StorageClass {
    String storageString="                                                                               Машинка для изготовления уроков Однажды постучался к нам очень странноватый и забавнй человечек - совершенно крошечный, чуток повыше 2-ух спичек. На спине он тащил огромную сумку, еще больше него самого. \n" +
            "- Я здесь различные машинки продаю... - представился он. \n" +
            "- Что за машинки? Покажите! - заинтересовался мой папа. \n" +
            "- Вот, например, машинка для изготовления уроков. Нажмешь красноватую кнопку - решит задачку, нажмешь желтоватую - напишет сочинение, зеленоватую - выучит урок по географии. Все сама сделает и стремительно - в одну минутку! \n" +
            "- Папа, купи! - обрадовался я. - Ну, хорошо. А сколько стоит? - Ничего не стоит! Я средств не беру, - ответил человечек. \n" +
            "- Но вы же не напрасно, должно быть, трудились? - Естественно. Исключительно в обмен на машинку мне средства не необходимы. Мне нужен мозг вашего отпрыска. \n" +
            "- Вы с разума сошли! - возмутился отец. - Ну посудите сами, - улыбнулся человечек. - Для чего ему мозг, если уроки за него станет делать машинка? \n" +
            "- Пап, купи! - стал я упрашивать отца. - И по правде, на что мне мозг, когда есть такая машинка! \n" +
            "Отец пристально поглядел на меня, помолчал малость и согласился: - Хорошо, забирайте его мозг, и по рукам! \n" +
            "Человечек взял у меня мозг и упрятал его в свою сумку. Каким же я сходу стал легким, когда опустела моя голова! Таким легким, что вспорхнул в воздух и начал летать по комнате. И если б отец впору не изловил меня, наверняка, я оказался бы по ту сторону окна. \n" +
            "- Придется держать его в клеточке, - предупредил человечек. - Почему? - опешил отец. \n" +
            "- Так как он сейчас безмозглый - вот почему! Не углядите, улетит в лес, как будто пичужка, и умрет там с голоду. \n" +
            "Отец посадил меня в клеточку, точно канарейку. Клеточка была малая, тесноватая - не пошевельнуться! Прутки так сжимали мне ребра, так сжимали, что я... в ужасе пробудился. Как отлично, что все это мне приснилось! Не поверите, я здесь же сел за уроки.";
    public String getStorageText(){
        return storageString;
    }
    public Integer getTextSize(){
        return storageString.length();
    }
}
